Revit 2027 API
AssetProperties.Size Property
 The number of the AssetProperty(s) in the object.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Size { get; }
Public ReadOnly Property Size As Integer
	Get
public:
property int Size {
	int get ();
}
member Size : int with get
Property Value
Int32
See Also
Reference
AssetProperties Class
Autodesk.Revit.DB.Visual Namespace